# 1) SQL QUERY FOR BOOKING & REVENUE

In [1]:
import pandas as pd
import sqlalchemy
import pymysql
import numpy as np
import datetime
import calendar
engine = sqlalchemy.create_engine("mysql+pymysql://nitesh.kr:yRpRtyJR0XSqVLibLT@dms002.healthians.co.in/testenv_prod")
query = ''' 
SELECT billing_cust_city, Sample_Date,Agent_name,Manager_Name,Dept_Name,booked_from,
delivery_status,
		COUNT(order_id) Bookings, 	
		
		COUNT(IF(sample_collecor_id >0 AND delivery_status = 3 AND sample_collection_time < cancelled_date,order_id,
                          IF(sample_collecor_id >0 AND delivery_status = 13 AND sample_collection_time < reshedule_date,order_id,
                          IF(sample_collecor_id >0 AND delivery_status NOT IN (3,13),order_id,NULL)))) 'Allocated_count',
                          
                    SUM(IF((is_sample_collected = 1 AND channel_type=0),1,
                     IF((is_sample_collected=1 AND channel_type<>0 AND payed_amount>0),1,0))) 'Picked_Orders', 

SUM(IF(delivery_status IN (3),1,0)) AS 'Cancelled_orders',

SUM(IF(delivery_status IN (13,26,27),1,0)) AS 'Rescheduled_OnHold_Orders',
                     
                     
                     SUM(IF((is_sample_collected = 1 AND channel_type=0),1,0)) 'Picked_Orders_B2C',
                     
                     SUM(IF((is_sample_collected=1 AND channel_type<>0 AND payed_amount>0),1,0)) 'Picked Orders_B2B', 
                     

                   SUM(IF(ref_booking_id = 0 AND delivery_status IN (0,-1,3,13),order_price,IF(ref_booking_id = 0 
                       AND delivery_status NOT IN (0,-1,3,13),allocated_amount,0))) 'BOOKING_AMOUNT',
                   
                   
		   SUM(IF(DATE(order_date) < CURDATE(),IF(delivery_status IN (0,-1,3,13), order_price, 
		   IF(DATE(sample_collection_time) <= CURDATE(), allocated_amount, order_price)), 
		   IF(delivery_status NOT IN (0,-1,3),order_price,0))) AS 'booking_amount_New',
                     
                   
                   
                          SUM(IF(sample_collecor_id >0 AND delivery_status = 3 AND sample_collection_time < cancelled_date,allocated_amount,
                          IF(sample_collecor_id >0 AND delivery_status = 13 AND sample_collection_time < reshedule_date,allocated_amount,
                          IF(sample_collecor_id >0 AND delivery_status NOT IN (3,13),allocated_amount,0)))) 'Allocated_amount',
                                    
                     
         
                     SUM(IF((is_sample_collected = 1 AND channel_type=0), payed_amount,
                     IF((is_sample_collected=1 AND channel_type<>0 AND payed_amount>0),payed_amount,0))) 'Overall_Revenue',
                     
                     
                     SUM(IF((New_no = Old_no AND is_sample_collected = 1 AND channel_type=0), payed_amount,
                     IF((New_no = Old_no AND is_sample_collected=1 AND channel_type<>0 AND payed_amount>0),payed_amount,0))) 'Overall_Revenue_Existing',
                     
                   
                     
                     SUM(IF(is_sample_collected = 1 AND channel_type=0, payed_amount,0)) 'Revenue_B2C',
                     
                     SUM(IF(is_sample_collected=1 AND channel_type<>0 AND payed_amount>0,payed_amount,0)) 'Revenue_B2B',
                     
                     
                     SUM(IF((booked_from != 'phlebo_app' AND is_sample_collected=1
                     AND payed_amount > allocated_amount),payed_amount - allocated_amount,
                     IF((booked_from = 'phlebo_app' AND is_sample_collected=1),payed_amount,0))) 
                     'Phlebo_addon',

               
                     
                     SUM(IF(sample_collection_time > NOW()
                     AND delivery_status NOT IN (-1,0,1,3,13,18,23),order_price,0)) need_to_be_collected ,
                     SUM(Existing_cust_order_count) 'Existing_cust_order',
                     COUNT(DISTINCT c_order_id) 'customer_count'
                     
                     FROM (
                     SELECT X.billing_cust_tel 'Old_no',X1.billing_cust_tel 'New_no',
                     IF(X.billing_cust_tel = X1.billing_cust_tel,1,0)'Existing_cust_order_count',                     
                     X.is_sample_collected, X.sample_collecor_id,allocated_amount,billing_cust_city,
                     X.order_id, X.ref_booking_id,X.order_price, X.payed_amount, X.sample_collection_time, 
                     X.order_date, X.delivery_status,X.booked_from,X.created_by,X.channel_type,
                     X.Agent_name,X.Manager_Name,X.Dept_Name,DATE(X.sample_collection_time) 'Sample_Date',X1.Max_date,
                     X.cancelled_date,X.reshedule_date,
                     cancelled_after,reshedule_after,X.allocated_amount_new,X.allocated_count_new, X.c_order_id
                                 
                     FROM
                     
                     (SELECT d.billing_cust_tel,d.is_sample_collected, d.sample_collecor_id,allocated_amount,billing_cust_city,
                     GROUP_CONCAT(DISTINCT u.contact_number), d.order_id, d.ref_booking_id,d.order_price, d.payed_amount, d.sample_collection_time, 
                     d.order_date, d.delivery_status,d.booked_from,d.created_by,d.channel_type,
                     IF(d.booked_from = 'crm',cu.name,IF(d.booked_from = 'phlebo_app',sc.name,0))
                     AS 'Agent_name',IF(d.booked_from = 'crm',cu1.name, IF(d.booked_from = 'phlebo_app',cu2.name,0)) AS 'Manager_Name',
                     IF(d.booked_from = 'crm',dm.dept_name,IF(d.booked_from='phlebo_app',dm1.dept_name,0)) AS 'Dept_Name',
                     camp_id,od.cancelled_date, d.reshedule_date,c_order_id,
                     IF(d.sample_collecor_id >0 AND d.delivery_status = 3 AND d.sample_collection_time < od.cancelled_date,1,0) 'cancelled_after',
                     IF(d.sample_collecor_id >0 AND d.delivery_status = 13 AND d.sample_collection_time < d.reshedule_date,1,0) 'reshedule_after',
                     
                     IF(d.sample_collecor_id >0 AND d.delivery_status = 3 AND d.sample_collection_time < od.cancelled_date,allocated_amount,
                          IF(d.sample_collecor_id >0 AND d.delivery_status = 13 AND d.sample_collection_time < d.reshedule_date,allocated_amount,
                          IF(d.sample_collecor_id >0 AND d.delivery_status NOT IN (3,13),allocated_amount,0))) 'allocated_amount_new',
                          
                      IF(d.sample_collecor_id >0 AND d.delivery_status = 3 AND d.sample_collection_time < od.cancelled_date,1,
                          IF(d.sample_collecor_id >0 AND d.delivery_status = 13 AND d.sample_collection_time < d.reshedule_date,1,
                          IF(d.sample_collecor_id >0 AND d.delivery_status NOT IN (3,13),1,0))) 'allocated_count_new'
                     
                     
                     FROM deal_order_management d 
                     LEFT JOIN deal_orders_child doc ON d.order_id = doc.order_id
                     LEFT JOIN order_details od ON doc.c_order_id = od.doc_id 
                     LEFT JOIN deal_user_management u ON doc.cust_id = u.user_id 
                    
                     LEFT JOIN crm_users AS cu ON d.created_by = cu.id
                     LEFT JOIN sample_collector sc ON d.created_by = sc.sid
                     LEFT JOIN crm_users AS cu1 ON cu1.id = cu.reporting_to
                     LEFT JOIN crm_users AS cu2 ON sc.supervisorID = cu2.id
                     LEFT JOIN dept_master AS dm ON dm.id = cu.dept_id
                     LEFT JOIN dept_master AS dm1 ON dm1.id = sc.dept_id
                     WHERE DATE(d.sample_collection_time) 
                     BETWEEN
                     LAST_DAY(CURDATE() - INTERVAL 2 MONTH)+ INTERVAL 1 DAY
                     AND 
                     LAST_DAY(CURDATE() - INTERVAL 2 MONTH) + INTERVAL DAY(DATE(CURDATE())) DAY 
                     GROUP BY d.order_id) X
                     LEFT JOIN
                     (SELECT dom.billing_cust_tel, MAX(DATE(dom.sample_collection_time)) 'Max_date', COUNT(dom.order_id) FROM deal_order_management dom
                     WHERE DATE(dom.sample_collection_time) < LAST_DAY(CURDATE() - INTERVAL 2 MONTH)+ INTERVAL 1 DAY GROUP BY dom.billing_cust_tel) X1
                     ON X.billing_cust_tel = X1.billing_cust_tel GROUP BY X.order_id) X2
                     GROUP BY billing_cust_city,Sample_Date,Agent_name,dept_name'''
df_master = pd.read_sql_query(query,engine)
engine.dispose()
df_master.head()

,billing_cust_city,Sample_Date,Agent_name,Manager_Name,Dept_Name,booked_from,delivery_status,Bookings,Allocated_count,Picked_Orders,...,booking_amount_New,Allocated_amount,Overall_Revenue,Overall_Revenue_Existing,Revenue_B2C,Revenue_B2B,Phlebo_addon,need_to_be_collected,Existing_cust_order,customer_count
0,Agra,2019-04-01,Jagrati,Saraswati,Outbound Sales,crm,15,1,1,1.0,...,1599.0,1599.0,1649.0,1649.0,1649.0,0.0,50.0,0.0,1.0,1
1,Agra,2019-04-01,Jitender Singh,Saraswati,Outbound Sales,crm,15,1,1,1.0,...,998.0,998.0,1048.0,1048.0,1048.0,0.0,50.0,0.0,1.0,1
2,Agra,2019-04-01,Neha Sharma,Saraswati,Outbound Sales,crm,15,1,1,1.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0,1
3,Agra,2019-04-01,Nishant Kumar,Bhawna Anand,Outbound Sales,crm,12,1,1,1.0,...,1499.0,1499.0,1909.0,0.0,1909.0,0.0,410.0,0.0,0.0,1
4,Agra,2019-04-01,Pradeep Pandey,Bhawna Anand,Outbound Sales,crm,26,1,1,0.0,...,998.0,998.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1

# 2) SQL QUERY FOR GROSS MARGIN

In [2]:

engine = sqlalchemy.create_engine("mysql+pymysql://nitesh.kr:yRpRtyJR0XSqVLibLT@dms002.healthians.co.in/testenv_prod")
query = ''' SELECT SUM(od.addon_cost)AS sum_addon_cost,dom.payed_amount AS payed_amount,dom.sample_collection_time,dom.order_id, billing_cust_city, dom.booked_from,
 dom.allocated_amount,DATE(dom.sample_collection_time)
	
	FROM deal_order_management dom LEFT JOIN deal_orders_child doc ON dom.order_id = doc.order_id
LEFT JOIN order_details od ON doc.c_order_id = od.doc_id

WHERE od.id IS NOT NULL AND
dom.is_sample_collected = 1 AND channel_type = 0 AND
dom.delivery_status NOT IN (-1,0,3,13) AND 
doc.delivery_status NOT IN (-1,2,3,4,5,6,13,14,18,23,27) AND doc.addon_flag != -1 AND
(od.order_delivery_status NOT IN (-1,2,3,4,5,6,13,14,18,23,27) OR  od.order_delivery_status IS NULL)
AND od.addon_flag !=-1 
AND DATE(dom.sample_collection_time) BETWEEN 
LAST_DAY(CURDATE() - INTERVAL 2 MONTH)+ INTERVAL 1 DAY 
AND 
LAST_DAY(CURDATE() - INTERVAL 2 MONTH) + INTERVAL DAY(DATE(CURDATE())) DAY 

AND (dom.role_id NOT IN (6,27) AND dom.created_by NOT IN (124,230,509))
 
GROUP BY dom.order_id'''
df_margin = pd.read_sql_query(query,engine)
engine.dispose()
df_margin.head()

,sum_addon_cost,payed_amount,sample_collection_time,order_id,billing_cust_city,booked_from,allocated_amount,DATE(dom.sample_collection_time)
0,1526.0,0,2019-04-22 08:00:00,808477551,Gurgaon,crm,0.0,2019-04-22
1,245.0,0,2019-04-18 06:00:00,810915981,Ghaziabad,phlebo_app,0.0,2019-04-18
2,63.0,0,2019-04-19 06:00:00,811935991,Ghaziabad,phlebo_app,0.0,2019-04-19
3,560.0,0,2019-04-21 06:00:00,873907671,Noida,crm,0.0,2019-04-21
4,1268.0,616,2019-04-12 09:00:00,878077271,Delhi,crm,0.0,2019-04-12

# 3) SQL QUERY FOR LEADS DATA

In [3]:
engine = sqlalchemy.create_engine("mysql+pymysql://nitesh.kr:yRpRtyJR0XSqVLibLT@dms002.healthians.co.in/testenv_prod")
query = ''' 
SELECT mas.city_check_final AS 'CITY', mas.Google_Facebook AS 'Leads_Tag',DATE(mas.xcreated) 'created_on',

COUNT(DISTINCT mas.lead_id) AS 'Leads' FROM 
(
SELECT  DISTINCT	 
	 IF(IF(IF(lal.lead_source IN (8,13,14,18,36,37), 'NCR', 
	IF((IF(lal.lead_city_name = '', dc.city_name,lal.lead_city_name) IS NULL OR  
		IF(lal.lead_city_name = '', dc.city_name,lal.lead_city_name) = '') AND 
		ad_name IS NOT NULL, 
		TRIM(SUBSTRING_INDEX(TRIM(SUBSTRING_INDEX(ad_name,'L:',-1)),',',1)),
		IF(lal.lead_city_name = '', dc.city_name,
		  lal.lead_city_name)))IS NULL, dom.billing_cust_city,
		  IF(lal.lead_source IN (8,13,14,18,36,37), 'NCR', 
	IF((IF(lal.lead_city_name = '', dc.city_name,lal.lead_city_name) IS NULL OR  
		IF(lal.lead_city_name = '', dc.city_name,lal.lead_city_name) = '') AND 
		ad_name IS NOT NULL, 
		TRIM(SUBSTRING_INDEX(TRIM(SUBSTRING_INDEX(ad_name,'L:',-1)),',',1)),IF(lal.lead_city_name = '', dc.city_name,
		  lal.lead_city_name)))) IS NULL,LEFT(lal.utm_campaign,LOCATE('-',lal.utm_campaign)-1),
		  
		  IF(IF(lal.lead_source IN (8,13,14,18,36,37), 'NCR', 
	IF((IF(lal.lead_city_name = '', dc.city_name,lal.lead_city_name) IS NULL OR  
		IF(lal.lead_city_name = '', dc.city_name,lal.lead_city_name) = '') AND 
		ad_name IS NOT NULL, 
		TRIM(SUBSTRING_INDEX(TRIM(SUBSTRING_INDEX(ad_name,'L:',-1)),',',1)),IF(lal.lead_city_name = '', dc.city_name,
		  lal.lead_city_name)))IS NULL, dom.billing_cust_city,
		  IF(lal.lead_source IN (8,13,14,18,36,37), 'NCR', 
	IF((IF(lal.lead_city_name = '', dc.city_name,lal.lead_city_name) IS NULL OR  
		IF(lal.lead_city_name = '', dc.city_name,lal.lead_city_name) = '') AND 
		ad_name IS NOT NULL, 
		TRIM(SUBSTRING_INDEX(TRIM(SUBSTRING_INDEX(ad_name,'L:',-1)),',',1)),IF(lal.lead_city_name = '', dc.city_name,
		  lal.lead_city_name)))))	
		  AS city_check_final,
		  IF(lal.lead_source IN (3,4,118,122), "Premium leads","Non Premium leads") AS lead_tag,
		  IF(lal.lead_source = 3,"Facebook",IF(lal.lead_source IN (4,69,118,122),"Google",
		  IF(lal.lead_source IN (13,14,15,16,27,28,36,37,38,44,49,50,52,79,82,93,101,116),"SMS_Campaigns","Others")))'Google_Facebook',

lm.lead_id,dom.order_id,lal.lead_source,dc.city_name,DATE(lal.created_on) 'xcreated'
FROM lead_master AS lm
LEFT JOIN 
lead_activity_log AS lal ON lm.lead_id = lal.lead_id 
LEFT JOIN
deal_order_management AS dom ON dom.billing_cust_tel = lm.contact_number AND DATE(dom.order_date) >= DATE(lal.created_on)
LEFT JOIN
lead_source AS ls ON ls.id = lal.lead_source
LEFT JOIN
deal_city AS dc ON lal.lead_city = dc.city_id
LEFT JOIN
crm_users AS cu ON cu.id = lal.agent_id
WHERE DATE(lal.created_on) BETWEEN 
(LAST_DAY(CURDATE() - INTERVAL 2 MONTH)) 
AND 
(LAST_DAY(CURDATE() - INTERVAL 2 MONTH)) + INTERVAL DAY((CURDATE() - INTERVAL 1 DAY)) DAY
AND lal.is_new_interest=1) AS mas
GROUP BY mas.city_check_final,mas.Google_Facebook,DATE(mas.xcreated)
ORDER BY mas.city_check_final,mas.Google_Facebook,DATE(mas.xcreated)'''
df_lead = pd.read_sql_query(query,engine)
engine.dispose()
df_lead.head()

C:\Users\nitesh.kumar\AppData\Local\Continuum\anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1292, "Truncated incorrect INTEGER value: 'Hyderabad'")
  result = self._query(query)
C:\Users\nitesh.kumar\AppData\Local\Continuum\anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1292, "Truncated incorrect INTEGER value: 'Noida'")
  result = self._query(query)
C:\Users\nitesh.kumar\AppData\Local\Continuum\anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1292, "Truncated incorrect INTEGER value: 'Bengaluru'")
  result = self._query(query)
C:\Users\nitesh.kumar\AppData\Local\Continuum\anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1292, "Truncated incorrect INTEGER value: 'up'")
  result = self._query(query)
C:\Users\nitesh.kumar\AppData\Local\Continuum\anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1292, "Truncated incorrect INTEGER value: 'bengaluru'")
  result = self._query(query)
C:\Users\nitesh.kumar\AppData\Local\Continuum\anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1292, "Truncated incorrect INTEGER value: 'mumbai'")
  result = self._query(query)
C:\Users\nitesh.kumar\AppData\Local\Continuum\anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1292, "Truncated incorrect INTEGER value: 'Delhi'")
  result = self._query(query)
C:\Users\nitesh.kumar\AppData\Local\Continuum\anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1292, "Truncated incorrect INTEGER value: 'ncr'")
  result = self._query(query)

   CITY Leads_Tag  created_on  Leads
0  None  Facebook  2019-03-31      8
1  None  Facebook  2019-04-01      7
2  None  Facebook  2019-04-02     27
3  None  Facebook  2019-04-03     11
4  None  Facebook  2019-04-04     10

# 4) SQL QUERY FOR KIT COST

In [4]:
engine = sqlalchemy.create_engine("mysql+pymysql://nitesh.kr:yRpRtyJR0XSqVLibLT@dms002.healthians.co.in/testenv_prod")
query = '''SELECT xdate, billing_cust_city, SUM(IF(bd = 'not_bd',custs,0)) 'NON_BD_customers'
FROM
(SELECT order_id, MIN(DATE(b1.sample_collection_time)) xmin, MAX(DATE(b1.sample_collection_time)) xmax, 
billing_cust_city, bd, COUNT(DISTINCT cust_id) custs, DATE(sample_collection_time) AS xdate
FROM
(SELECT d1.order_id, d1.cust_id, d.delivery_status, d.sample_collection_time, 
IF(d.billing_cust_city = 23,'Gurgaon',IF(d.billing_cust_city = 1595,'Delhi',d.billing_cust_city)) billing_cust_city, d.is_sample_collected, d.billing_cusT_name, d1.customer_name, d.payed_amount,
IF(d.channel_type = 0,'not_bd','bd') bd
FROM deal_order_management d
LEFT JOIN deal_orders_child d1
ON d.order_id = d1.order_id
WHERE DATE(d.sample_collection_time) BETWEEN 
LAST_DAY(CURDATE() - INTERVAL 2 MONTH)+ INTERVAL 1 DAY 
AND 
LAST_DAY(CURDATE() - INTERVAL 2 MONTH) + INTERVAL DAY(DATE(CURDATE())) DAY 
AND is_sample_collected = 1
AND d.delivery_status IN (7,8,9,12,15,21,23,18,26,25,27,28)) b1
GROUP BY order_id) b2
GROUP BY billing_cust_city, xdate
ORDER BY 'NON_BD_customers' DESC'''
df_kit = pd.read_sql_query(query,engine)
df_kit['kit_cost'] = df_kit['NON_BD_customers']*33.5
engine.dispose()
df_kit.head()

C:\Users\nitesh.kumar\AppData\Local\Continuum\anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1292, "Truncated incorrect DOUBLE value: 'Gurgaon'")
  result = self._query(query)
C:\Users\nitesh.kumar\AppData\Local\Continuum\anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1292, "Truncated incorrect DOUBLE value: 'Ghaziabad'")
  result = self._query(query)
C:\Users\nitesh.kumar\AppData\Local\Continuum\anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1292, "Truncated incorrect DOUBLE value: 'Noida'")
  result = self._query(query)
C:\Users\nitesh.kumar\AppData\Local\Continuum\anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1292, "Truncated incorrect DOUBLE value: 'Delhi'")
  result = self._query(query)
C:\Users\nitesh.kumar\AppData\Local\Continuum\anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1292, "Truncated incorrect DOUBLE value: 'Pune'")
  result = self._query(query)
C:\Users\nitesh.kumar\AppData\Local\Continuum\anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1292, "Truncated incorrect DOUBLE value: 'Agra'")
  result = self._query(query)
C:\Users\nitesh.kumar\AppData\Local\Continuum\anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1292, "Truncated incorrect DOUBLE value: 'Greater Noida'")
  result = self._query(query)
C:\Users\nitesh.kumar\AppData\Local\Continuum\anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1292, "Truncated incorrect DOUBLE value: 'Mumbai'")
  result = self._query(query)
C:\Users\nitesh.kumar\AppData\Local\Continuum\anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1292, "Truncated incorrect DOUBLE value: 'Chandigarh'")
  result = self._query(query)
C:\Users\nitesh.kumar\AppData\Local\Continuum\anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1292, "Truncated incorrect DOUBLE value: 'Lucknow'")
  result = self._query(query)
C:\Users\nitesh.kumar\AppData\Local\Continuum\anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1292, "Truncated incorrect DOUBLE value: 'Faridabad'")
  result = self._query(query)
C:\Users\nitesh.kumar\AppData\Local\Continuum\anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1292, "Truncated incorrect DOUBLE value: 'Bengaluru'")
  result = self._query(query)

        xdate billing_cust_city  NON_BD_customers  kit_cost
0  2019-04-22           Gurgaon              71.0    2378.5
1  2019-04-18         Ghaziabad              44.0    1474.0
2  2019-04-19         Ghaziabad              50.0    1675.0
3  2019-04-21             Noida              76.0    2546.0
4  2019-04-12             Delhi             351.0   11758.5

# 5) SQL QUERY FOR FACEBOOK COST

In [5]:
engine = sqlalchemy.create_engine("mysql+pymysql://nitesh.kr:yRpRtyJR0XSqVLibLT@dms002.healthians.co.in/testenv_prod")
query = '''
SELECT SUBSTRING(lcd.campaign_name,3,LOCATE(',',lcd.campaign_name,1)-3)
AS 'city',ROUND(SUM(sms_rate),2) AS 'Facebook_cost' FROM `lead_campaign_detail` lcd 
WHERE DATE(Date_time) BETWEEN 
(LAST_DAY(CURDATE() - INTERVAL 2 MONTH)) 
AND 
(LAST_DAY(CURDATE() - INTERVAL 2 MONTH)) + INTERVAL DAY((CURDATE() - INTERVAL 1 DAY)) DAY
GROUP BY city'''
df_FBcost = pd.read_sql_query(query,engine)
engine.dispose()
df_FBcost

                  city  Facebook_cost
0                          1975566.74
1                 AGRA       91238.73
2   AMRITSAR/JALANDHAR       34767.16
3    AMRITSAR/JALNDHAR       79405.36
4            BENGALURU      713714.63
5               BHOPAL       39208.30
6           CHANDIGARH      279333.46
7             DEHRADUN       93076.87
8              HARYANA      179676.11
9            HYDERABAD      243947.92
10              INDORE       42230.03
11              JAIPUR      215461.36
12              KANPUR      180770.05
13             LUCKNOW      230445.16
14            LUDHIANA       67627.93
15              MEERUT       82148.43
16              MUMBAI      596831.46
17                 NCR     1229277.25
18             PATIALA       60912.38
19                PUNE      312606.36
20              PUNJAB      211495.22
21                  UP        2760.70

# 6) SQL QUERY FOR GOOGLE COST

In [6]:
engine = sqlalchemy.create_engine("mysql+pymysql://nitesh.kr:yRpRtyJR0XSqVLibLT@dms002.healthians.co.in/testenv_prod")
query = '''
SELECT SUBSTRING(lcd.campaign_name,1,LOCATE(':',lcd.campaign_name,1)-1) AS 'city',ROUND(SUM(sms_rate),2) AS 'Google_cost' 
FROM lead_campaign_detail lcd
WHERE lcd.vendor_id IN (4,69,118,122) AND DATE(Date_time) BETWEEN 
(LAST_DAY(CURDATE() - INTERVAL 2 MONTH)) 
AND 
(LAST_DAY(CURDATE() - INTERVAL 2 MONTH)) + INTERVAL DAY((CURDATE() - INTERVAL 1 DAY)) DAY
GROUP BY city'''
df_Googlecost = pd.read_sql_query(query,engine)
engine.dispose()
df_Googlecost.head()

         city  Google_cost
0                 38586.76
1  Bangalore     270932.48
2     Haryana     22227.98
3   Hyderabad    119921.68
4          MP     16708.20

# 7) SQL QUERY FOR CITY & STATE

In [7]:
%pwd
%cd D:\Raw_Data\City Vs State
df_city = pd.read_csv('city_vs_state.csv')

D:\Raw_Data\City Vs State

# 8) No. of days MTD & overall

In [8]:
now = datetime.datetime.now()
mtd_days=now.day
overall_days=calendar.monthrange(now.year, now.month-1)[1]

# 11) Booking & Revenue DETAILED

In [9]:
dfg2 = df_master.merge(df_city,left_on ='billing_cust_city',right_on = 'Lead_City', how = 'inner')
dfg3=dfg2.drop(columns = 'Lead_City')
dfg4=pd.DataFrame(dfg3.groupby(['State'])['Bookings'].sum())
dfg4.head()
dfg4.reset_index(inplace=True)

var = ['BOOKING_AMOUNT','Allocated_count','Allocated_amount','Cancelled_orders','Rescheduled_OnHold_Orders','Picked_Orders','Overall_Revenue','Phlebo_addon']
for num_var in var:
    dfg5=pd.DataFrame(dfg3.groupby(['State'])[num_var].sum())
    dfg4=pd.merge(dfg4,dfg5,left_on = 'State',right_on = 'State',how = 'inner')
    
dfg7=dfg4[['State','Bookings','BOOKING_AMOUNT','Allocated_count','Allocated_amount','Cancelled_orders','Rescheduled_OnHold_Orders','Picked_Orders','Overall_Revenue','Phlebo_addon']]

def var_sum(x):
    return pd.Series(np.sum(x))


dfg7 = dfg7._get_numeric_data().apply(lambda x : var_sum(x))

df_gross=pd.concat([dfg4,dfg7],sort=False)

df_gross['State'].fillna('Total',inplace = True)
df_gross

,State,Bookings,BOOKING_AMOUNT,Allocated_count,Allocated_amount,Cancelled_orders,Rescheduled_OnHold_Orders,Picked_Orders,Overall_Revenue,Phlebo_addon
0,BLR,2369,2810753.0,1921,2563803.0,481.0,548.0,1280.0,1866054.0,215655.0
1,Dehradun,685,797440.0,605,763738.0,97.0,150.0,428.0,654828.0,166401.0
2,HR,791,1006260.0,671,916963.0,112.0,111.0,500.0,845274.0,238940.0
3,Hyderabad,967,1099578.0,785,978313.0,212.0,243.0,458.0,628884.0,64873.0
4,Jaipur,859,983691.0,731,861029.0,144.0,140.0,551.0,787391.0,213596.0
5,MP,760,746680.0,661,708812.0,138.0,186.0,428.0,496845.0,119838.0
6,Mumbai,2789,3743976.0,2281,3442127.0,544.0,569.0,1629.0,2724400.0,382141.0
7,NCR,17281,19028286.0,14730,17584223.0,2011.0,1860.0,12590.0,18716424.0,4462100.0
8,PCM,1226,1518070.0,1050,1333226.0,190.0,160.0,836.0,1277775.0,253510.0
9,Pune,1475,1934913.0,1222,1763212.0,325.0,360.0,749.0,1215820.0,198844.0
10,Punjab,2021,2373987.0,1744,2122219.0,297.0,252.0,1411.0,2472519.0,889526.0
11,UP,3118,3538024.0,2728,3304713.0,440.0,458.0,2157.0,3184613.0,845011.0
0,Total,34341,39581658.0,29129,36342378.0,4991.0,5037.0,23017.0,34870827.0,8050435.0

# 22) GROSS MARGIN DETAILED

In [10]:
df_margin['payed_amount']=df_margin['payed_amount'].apply(pd.to_numeric)

dfm2 = df_margin.merge(df_city,left_on ='billing_cust_city',right_on = 'Lead_City', how = 'inner')
dfm3=dfm2.drop(columns = 'Lead_City')
dfm4=pd.DataFrame(dfm3.groupby(['State'])['payed_amount'].sum())
dfm4.head()
dfm4.reset_index(inplace=True)

dfm5=pd.DataFrame(dfm3.groupby(['State'])['sum_addon_cost'].sum())
dfm4=pd.merge(dfm4,dfm5,left_on = 'State',right_on = 'State',how = 'inner')
dfm5=pd.DataFrame(dfm3.groupby(['State'])['order_id'].count())
dfm4=pd.merge(dfm4,dfm5,left_on = 'State',right_on = 'State',how = 'inner')

p=424552/overall_days*mtd_days
p

q_BLR=np.sum(dfm4.iloc[0:1,-1:])
q_BLR

q_HYD=np.sum(dfm4.iloc[3:4,-1:])
q_HYD

cost_prop_BLR = np.sum(p*(q_BLR/(q_HYD+q_BLR)))
cost_prop_BLR

cost_prop_HYD = np.sum(p*(q_HYD/(q_HYD+q_BLR)))
cost_prop_HYD

dfm4['blr_cost']=dfm4['State'].apply(lambda x:cost_prop_BLR if x=='BLR' else cost_prop_HYD if x=='Hyderabad' else 0.0) 
dfm4['Total_Cost']=dfm4['sum_addon_cost']+dfm4['blr_cost']
dfm4['Gross_Margin']=dfm4['payed_amount']-dfm4['Total_Cost']
dfm5=dfm4[['payed_amount', 'sum_addon_cost', 'order_id', 'blr_cost',
        'Total_Cost', 'Gross_Margin']]

def var_sum(x):
    return pd.Series(np.sum(x))

dfm5 = dfm5._get_numeric_data().apply(lambda x : var_sum(x))

dfm4=pd.concat([dfm4,dfm5],sort=False)
dfm4['State'].fillna('Total',inplace = True)

dfm4['Gross_Margin']=round(dfm4['Gross_Margin'],0)
dfm4['Gross_Margin/order']=round(dfm4['Gross_Margin']/dfm4['order_id'],0)
dfm4['Gross_Margin%']=round(dfm4['Gross_Margin']/dfm4['payed_amount'],2)
dfm4['ASP']=round(dfm4['payed_amount']/dfm4['order_id'],0)
df_margin_final=dfm4[['State','Gross_Margin','Gross_Margin/order','Gross_Margin%','ASP']]
df_margin_final

        State  Gross_Margin  Gross_Margin/order  Gross_Margin%     ASP
0         BLR     1139167.0               897.0           0.61  1465.0
1    Dehradun      391728.0               937.0           0.61  1540.0
2          HR      500830.0              1008.0           0.60  1693.0
3   Hyderabad      382321.0               851.0           0.61  1388.0
4      Jaipur      436107.0               808.0           0.56  1438.0
5          MP      392749.0               922.0           0.79  1166.0
6      Mumbai     1709704.0              1061.0           0.63  1671.0
7         NCR    10121564.0               813.0           0.54  1496.0
8         PCM      760903.0               920.0           0.60  1539.0
9        Pune      747056.0              1008.0           0.62  1615.0
10     Punjab     1283278.0               930.0           0.52  1775.0
11         UP     1884315.0               931.0           0.61  1521.0
0       Total    19749723.0               873.0           0.57  1527.0

# 33) LEADS DATA DETAILED

In [11]:
df_lead.dropna(axis=0,how = 'any').shape

dfl2 = df_lead.merge(df_city,left_on ='CITY',right_on = 'Lead_City', how = 'inner')
dfl3=dfl2.drop(columns = ['Lead_City'])
dfl3=dfl3.drop_duplicates(keep='last')

dfl4=pd.DataFrame(dfl3[(dfl3['Leads_Tag'] == 'Facebook')].groupby(['State'])['Leads'].sum())
dfl4.reset_index(inplace=True)

dfl5=pd.DataFrame(dfl3[(dfl3['Leads_Tag'] == 'Google')].groupby(['State'])['Leads'].sum())

dfl4=pd.merge(dfl4,dfl5,left_on = 'State',right_on = 'State', how = 'inner')
dfl4.rename(columns={'Leads_x':'Facebook','Leads_y':'Google'},inplace=True)

dfl6 = dfl4[['Facebook','Google']]

def var_sum(x):
    return pd.Series(np.sum(x))

dfl6 = dfl6._get_numeric_data().apply(lambda x : var_sum(x))

df_lead_final=pd.concat([dfl4,dfl6],sort=False)
df_lead_final['State'].fillna('Total',inplace = True)
df_lead_final

        State  Facebook  Google
0         BLR      5001    1582
1    Dehradun      1018     168
2          HR      1011     240
3   Hyderabad      2408     698
4      Jaipur      1220     324
5          MP      2431     181
6      Mumbai      4854    1784
7         NCR      7901    5743
8         PCM      1446     490
9        Pune      2710     848
10     Punjab      3032     497
11         UP      3943     858
0       Total     36975   13413

# 44) KIT COST DETAILED

In [12]:
dfk2 = df_kit.merge(df_city,left_on ='billing_cust_city',right_on = 'Lead_City', how = 'inner')
dfk3=dfk2.drop(columns = 'Lead_City')
dfk4=pd.DataFrame(dfk3.groupby(['State'])['kit_cost'].sum())
dfk4.head()
dfk4.reset_index(inplace=True)
dfk5 = dfk4[['kit_cost']]
def var_sum(x):
    return pd.Series(np.sum(x))

dfk5 = dfk5._get_numeric_data().apply(lambda x : var_sum(x))

df_kit_Final=pd.concat([dfk4,dfk5],sort=False)
df_kit_Final['State'].fillna('Total',inplace = True)
df_kit_Final

        State   kit_cost
0         BLR    59529.5
1    Dehradun    23182.0
2          HR    28240.5
3   Hyderabad    21909.0
4      Jaipur    29580.5
5          MP    20368.0
6      Mumbai    81874.0
7         NCR   608494.0
8         PCM    43550.0
9        Pune    36347.5
10     Punjab    82410.0
11         UP   110516.5
0       Total  1146001.5

# 55) FACEBOOK COST DETAILED

In [13]:
df_FBcost['city'].dropna(axis=0,inplace=True)
dfc1=df_FBcost.merge(df_city,left_on ='city',right_on = 'Lead_City', how = 'inner')
dfc1=dfc1.drop(columns = 'Lead_City')
dfc1['State'].dropna(inplace=True)

dfc2=pd.DataFrame(dfc1.groupby(['State'])['Facebook_cost'].sum())
dfc2.head()
dfc2.reset_index(inplace=True)

dfc3 = dfc2[['Facebook_cost']]
def var_sum(x):
    return pd.Series(np.sum(x))

dfc3 = dfc3._get_numeric_data().apply(lambda x : var_sum(x))

df_fbcost_final=pd.concat([dfc2,dfc3],sort=False)
df_fbcost_final['State'].fillna('Total',inplace = True)
df_fbcost_final

        State  Facebook_cost
0         BLR      713714.63
1    Dehradun       93076.87
2          HR      179676.11
3   Hyderabad      243947.92
4      Jaipur      215461.36
5          MP       81438.33
6      Mumbai      596831.46
7         NCR     1229277.25
8         PCM      279333.46
9        Pune      312606.36
10     Punjab      454208.05
11         UP      587363.07
0       Total     4986934.87

# 66) GOOGLE COST DETAILED

In [14]:
df_Googlecost['city'].dropna(axis=0,inplace=True)
dfc1=df_Googlecost.merge(df_city,left_on ='city',right_on = 'Lead_City', how = 'left')
dfc1=dfc1.drop(columns = 'Lead_City')
dfc1['State'].fillna('NCR',inplace=True)

dfc2=pd.DataFrame(dfc1.groupby(['State'])['Google_cost'].sum())
dfc2.head()
dfc2.reset_index(inplace=True)

dfc3 = dfc2[['Google_cost']]
def var_sum(x):
    return pd.Series(np.sum(x))

dfc3 = dfc3._get_numeric_data().apply(lambda x : var_sum(x))

df_Googlecost_final=pd.concat([dfc2,dfc3],sort=False)
df_Googlecost_final['State'].fillna('Total',inplace = True)
df_Googlecost_final

        State  Google_cost
0         BLR    270932.48
1    Dehradun     19335.76
2          HR     22227.98
3   Hyderabad    119921.68
4      Jaipur     45941.34
5          MP     16708.20
6      Mumbai    286450.71
7         NCR    815956.52
8         PCM     75437.87
9        Pune    123143.91
10     Punjab     65567.23
11         UP    113916.55
0       Total   1975540.23

In [15]:
# FINAL MERGING OF ALL DF

In [16]:
df_LMTD_FINAL1 = pd.merge(df_gross,df_margin_final,left_on='State',right_on='State',how='inner')

In [17]:
df_LMTD_FINAL2=pd.merge(df_LMTD_FINAL1,df_lead_final,left_on='State',right_on='State',how='inner')

In [18]:
df_LMTD_FINAL3=pd.merge(df_LMTD_FINAL2,df_kit_Final,left_on='State',right_on='State',how='inner')

In [19]:
df_LMTD_FINAL4=pd.merge(df_LMTD_FINAL3,df_fbcost_final,left_on='State',right_on='State',how='inner')

In [20]:
df_LMTD_FINAL5=pd.merge(df_LMTD_FINAL4,df_Googlecost_final,left_on='State',right_on='State',how='inner')
df_LMTD_FINAL5

,State,Bookings,BOOKING_AMOUNT,Allocated_count,Allocated_amount,Cancelled_orders,Rescheduled_OnHold_Orders,Picked_Orders,Overall_Revenue,Phlebo_addon,Gross_Margin,Gross_Margin/order,Gross_Margin%,ASP,Facebook,Google,kit_cost,Facebook_cost,Google_cost
0,BLR,2369,2810753.0,1921,2563803.0,481.0,548.0,1280.0,1866054.0,215655.0,1139167.0,897.0,0.61,1465.0,5001,1582,59529.5,713714.63,270932.48
1,Dehradun,685,797440.0,605,763738.0,97.0,150.0,428.0,654828.0,166401.0,391728.0,937.0,0.61,1540.0,1018,168,23182.0,93076.87,19335.76
2,HR,791,1006260.0,671,916963.0,112.0,111.0,500.0,845274.0,238940.0,500830.0,1008.0,0.60,1693.0,1011,240,28240.5,179676.11,22227.98
3,Hyderabad,967,1099578.0,785,978313.0,212.0,243.0,458.0,628884.0,64873.0,382321.0,851.0,0.61,1388.0,2408,698,21909.0,243947.92,119921.68
4,Jaipur,859,983691.0,731,861029.0,144.0,140.0,551.0,787391.0,213596.0,436107.0,808.0,0.56,1438.0,1220,324,29580.5,215461.36,45941.34
5,MP,760,746680.0,661,708812.0,138.0,186.0,428.0,496845.0,119838.0,392749.0,922.0,0.79,1166.0,2431,181,20368.0,81438.33,16708.20
6,Mumbai,2789,3743976.0,2281,3442127.0,544.0,569.0,1629.0,2724400.0,382141.0,1709704.0,1061.0,0.63,1671.0,4854,1784,81874.0,596831.46,286450.71
7,NCR,17281,19028286.0,14730,17584223.0,2011.0,1860.0,12590.0,18716424.0,4462100.0,10121564.0,813.0,0.54,1496.0,7901,5743,608494.0,1229277.25,815956.52
8,PCM,1226,1518070.0,1050,1333226.0,190.0,160.0,836.0,1277775.0,253510.0,760903.0,920.0,0.60,1539.0,1446,490,43550.0,279333.46,75437.87
9,Pune,1475,1934913.0,1222,1763212.0,325.0,360.0,749.0,1215820.0,198844.0,747056.0,1008.0,0.62,1615.0,2710,848,36347.5,312606.36,123143.91
10,Punjab,2021,2373987.0,1744,2122219.0,297.0,252.0,1411.0,2472519.0,889526.0,1283278.0,930.0,0.52,1775.0,3032,497,82410.0,454208.05,65567.23
11,UP,3118,3538024.0,2728,3304713.0,440.0,458.0,2157.0,3184613.0,845011.0,1884315.0,931.0,0.61,1521.0,3943,858,110516.5,587363.07,113916.55
12,Total,34341,39581658.0,29129,36342378.0,4991.0,5037.0,23017.0,34870827.0,8050435.0,19749723.0,873.0,0.57,1527.0,36975,13413,1146001.5,4986934.87,1975540.23

In [21]:
dfl3_google = dfl3[dfl3['Leads_Tag'] == 'Google'].pivot_table(index=['State'],columns=['created_on'],values='Leads',aggfunc=np.sum)
dfl3_google.reset_index()

def var_sum(x):
    return pd.Series(np.sum(x))


dfl3_g_sum = dfl3_google._get_numeric_data().apply(lambda x : var_sum(x))

dfl3_google=pd.concat([dfl3_google,dfl3_g_sum],axis=0,sort=False)

dfl3_google.reset_index(inplace=True)
dfl3_google.rename(columns = {'index' : 'State'},inplace=True)
dfl3_google.fillna(0, inplace = True)
dfl3_google.loc[dfl3_google.shape[0]-1,'State'] = 'Total'
dfl3_google

created_on,State,2019-03-31,2019-04-01,2019-04-02,2019-04-03,2019-04-04,2019-04-05,2019-04-06,2019-04-07,2019-04-08,...,2019-04-20,2019-04-21,2019-04-22,2019-04-23,2019-04-24,2019-04-25,2019-04-26,2019-04-27,2019-04-28,2019-04-29
0,BLR,39.0,59.0,62.0,47.0,43.0,57.0,55.0,62.0,57.0,...,51.0,42.0,41.0,63.0,51.0,67.0,64.0,55.0,62.0,58.0
1,Dehradun,2.0,8.0,5.0,4.0,5.0,5.0,8.0,4.0,4.0,...,4.0,2.0,5.0,4.0,13.0,6.0,7.0,2.0,9.0,6.0
2,HR,12.0,11.0,10.0,7.0,4.0,6.0,4.0,16.0,7.0,...,7.0,4.0,11.0,9.0,13.0,8.0,6.0,9.0,5.0,7.0
3,Hyderabad,19.0,23.0,18.0,27.0,19.0,30.0,20.0,25.0,30.0,...,22.0,27.0,29.0,27.0,27.0,30.0,18.0,34.0,23.0,29.0
4,Jaipur,14.0,9.0,17.0,17.0,15.0,10.0,11.0,8.0,8.0,...,8.0,13.0,10.0,11.0,13.0,13.0,9.0,10.0,14.0,9.0
5,MP,0.0,1.0,3.0,1.0,10.0,5.0,5.0,5.0,5.0,...,9.0,8.0,6.0,9.0,5.0,5.0,6.0,6.0,7.0,11.0
6,Mumbai,38.0,62.0,62.0,58.0,74.0,53.0,57.0,49.0,76.0,...,55.0,50.0,79.0,70.0,68.0,63.0,60.0,51.0,47.0,63.0
7,NCR,186.0,221.0,219.0,206.0,187.0,209.0,193.0,182.0,227.0,...,181.0,155.0,202.0,214.0,186.0,187.0,175.0,232.0,204.0,154.0
8,PCM,7.0,18.0,14.0,15.0,16.0,16.0,21.0,15.0,11.0,...,17.0,16.0,24.0,17.0,17.0,23.0,14.0,14.0,13.0,17.0
9,Pune,25.0,43.0,29.0,24.0,18.0,25.0,16.0,23.0,18.0,...,38.0,25.0,36.0,37.0,18.0,40.0,29.0,27.0,31.0,37.0
10,Punjab,11.0,16.0,18.0,28.0,14.0,21.0,15.0,14.0,27.0,...,25.0,11.0,17.0,11.0,13.0,23.0,10.0,17.0,8.0,10.0
11,UP,26.0,20.0,31.0,20.0,27.0,26.0,25.0,20.0,36.0,...,27.0,36.0,38.0,23.0,39.0,22.0,30.0,42.0,31.0,31.0
12,Total,379.0,491.0,488.0,454.0,432.0,463.0,430.0,423.0,506.0,...,444.0,389.0,498.0,495.0,463.0,487.0,428.0,499.0,454.0,432.0

In [22]:
dfl3_fb = dfl3[dfl3['Leads_Tag'] == 'Facebook'].pivot_table(index=['State'],columns=['created_on'],values='Leads',aggfunc=np.sum)
dfl3_fb.reset_index()

def var_sum(x):
    return pd.Series(np.sum(x))


dfl3_fb_sum = dfl3_fb._get_numeric_data().apply(lambda x : var_sum(x))

dfl3_fb = pd.concat([dfl3_fb,dfl3_fb_sum],axis=0,sort=False)

dfl3_fb.reset_index(inplace=True)
dfl3_fb.rename(columns = {'index' : 'State'},inplace=True)
dfl3_fb.fillna(0, inplace = True)
dfl3_fb.loc[dfl3_fb.shape[0]-1,'State'] = 'Total'
dfl3_fb

created_on,State,2019-03-31,2019-04-01,2019-04-02,2019-04-03,2019-04-04,2019-04-05,2019-04-06,2019-04-07,2019-04-08,...,2019-04-20,2019-04-21,2019-04-22,2019-04-23,2019-04-24,2019-04-25,2019-04-26,2019-04-27,2019-04-28,2019-04-29
0,BLR,155.0,157.0,163.0,170.0,160.0,125.0,154.0,141.0,173.0,...,175.0,185.0,212.0,200.0,199.0,201.0,177.0,146.0,147.0,182.0
1,Dehradun,41.0,36.0,44.0,37.0,39.0,27.0,30.0,35.0,36.0,...,34.0,27.0,43.0,35.0,55.0,47.0,28.0,36.0,42.0,42.0
2,HR,26.0,39.0,41.0,52.0,32.0,32.0,33.0,26.0,45.0,...,31.0,41.0,39.0,34.0,47.0,35.0,68.0,35.0,30.0,19.0
3,Hyderabad,67.0,81.0,103.0,101.0,96.0,84.0,48.0,78.0,73.0,...,90.0,85.0,98.0,99.0,75.0,86.0,70.0,81.0,77.0,83.0
4,Jaipur,50.0,58.0,51.0,49.0,55.0,36.0,46.0,41.0,49.0,...,45.0,53.0,18.0,34.0,29.0,17.0,37.0,36.0,25.0,30.0
5,MP,0.0,0.0,0.0,41.0,112.0,85.0,87.0,68.0,86.0,...,98.0,86.0,86.0,87.0,91.0,101.0,93.0,63.0,67.0,87.0
6,Mumbai,133.0,192.0,189.0,176.0,167.0,139.0,153.0,142.0,143.0,...,148.0,194.0,217.0,199.0,165.0,154.0,185.0,181.0,169.0,182.0
7,NCR,295.0,296.0,283.0,274.0,271.0,236.0,276.0,260.0,294.0,...,258.0,247.0,301.0,333.0,280.0,293.0,291.0,256.0,271.0,258.0
8,PCM,48.0,66.0,63.0,70.0,49.0,55.0,51.0,42.0,68.0,...,46.0,39.0,46.0,51.0,49.0,52.0,34.0,55.0,38.0,46.0
9,Pune,47.0,114.0,106.0,89.0,99.0,91.0,78.0,73.0,93.0,...,108.0,87.0,102.0,101.0,101.0,111.0,101.0,86.0,99.0,86.0
10,Punjab,91.0,104.0,109.0,105.0,93.0,105.0,100.0,110.0,106.0,...,72.0,122.0,116.0,104.0,102.0,120.0,100.0,139.0,139.0,146.0
11,UP,136.0,158.0,129.0,137.0,137.0,135.0,155.0,150.0,133.0,...,118.0,132.0,158.0,136.0,136.0,141.0,126.0,114.0,120.0,134.0
12,Total,1089.0,1301.0,1281.0,1301.0,1310.0,1150.0,1211.0,1166.0,1299.0,...,1223.0,1298.0,1436.0,1413.0,1329.0,1358.0,1310.0,1228.0,1224.0,1295.0

In [23]:
from openpyxl import load_workbook
book = load_workbook('leads_summary.xlsx')
writer = pd.ExcelWriter('leads_summary.xlsx', engine='openpyxl')
writer.book = book
df_LMTD_FINAL5.to_excel(writer,sheet_name="LMTD",header='infer', index=False,startcol=0,startrow=0)
dfl3_fb.to_excel(writer,sheet_name="LMTD",header='infer', index=False,startcol=0,startrow=17)
dfl3_google.to_excel(writer,sheet_name="LMTD",header='infer', index=False,startcol=0,startrow=35)
writer.save()